
/*[문제1] 고객 테이블의 모든 데이터를 조회하시오. */
SELECT * from 고객;

/*[문제2] 제품 테이블에서 제품명과 단가만 조회하시오.*/
SELECT 제품명, 단가 from 제품;

/*[문제3] 나이가 25세 이상인 고객의 모든 정보를 조회하시오.*/
SELECT * from 고객 WHERE (나이>=25);

/*[문제4] 단가가 50,000원 이하인 제품의 제품명과 단가를 조회하시오.*/
SELECT 제품명, 단가 FROM 제품 WHERE (단가 <= 50000);

/*[문제5]* 고객을 나이가 많은 순서대로 조회하시오.*/
SELECT * FROM 고객 ORDER BY 나이 DESC;

/*[문제6] 제품 테이블에 등록된 제품의 개수를 구하시오.*/
SELECT COUNT(*) AS 총제품의개수 FROM 제품;

/*[문제7] 제품의 평균 단가를 구하시오.*/
SELECT AVG(단가) AS 평균단가 FROM 제품;

/*[문제8] 포인트가 2000 이상 4000 이하인 고객의 이름과 포인트를 조회하시오.*/
SELECT 이름, 포인트 FROM 고객 WHERE (포인트 >= 2000) AND (포인트 <= 4000);